tutorials/multiRegion/CHT/circuitBoardCooling/0/baffle3D/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(floor|baffle3D0|baffle3D1|baffle3D_side)"
    {
        type            zeroGradient;
    }

    "baffle3D_to_fluid_.*"
    {
        type            coupledTemperature;
        value           $internalField;
    }
}


// ************************************************************************* //
